dependencies/OpenFOAM/tutorials/incompressible/pimpleFoam/laminar/planarPoiseuille/setups.orig/common/system/singleGraph
// -*- C++ -*-

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type            sets;
libs            (sampling);
writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;
fields          ( U );

setConfig
{
    type    midPoint;
    axis    distance;  // x, y, z, xyz
}

sets
{
    line
    {
        $setConfig;
        start (0 0 0);
        end   (0 1 0);
    }
}


// ************************************************************************* //
